espressif/esp-idf/examples/ethernet/iperf/sdkconfig.ci.worst_case_perf_w5500_c2
# ------------------------------------------------------------------------
# LOW PERFORMANCE BASELINE: IRAM Optimizations Disabled for Validation
# ------------------------------------------------------------------------
# This configuration is intentionally set up to represent a *worst-case*
# performance profile:
# - All IRAM optimizations for lwIP and Ethernet are disabled
# - The goal is NOT to optimize but to validate that the system still works
#   and to establish a functional baseline under poor performance conditions
#
# DO NOT USE THIS CONFIG FOR PERFORMANCE BENCHMARKING!
# It exists to validate stability and functionality in low-IRAM scenarios.

CONFIG_IDF_TARGET="esp32c2"

# Disable lwIP IRAM optimization (overrides sdkconfig.defaults)
CONFIG_LWIP_IRAM_OPTIMIZATION=n
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=n

# Disable Ethernet IRAM optimization (overrides sdkconfig.defaults)
CONFIG_ETH_IRAM_OPTIMIZATION=n

# Config Ethernet Init and Choose w5500
CONFIG_ETHERNET_SPI_SUPPORT=y
CONFIG_ETHERNET_INTERNAL_SUPPORT=n
CONFIG_ETHERNET_SPI_DEV0_W5500=y
CONFIG_ETHERNET_SPI_DEV1_NONE=y
CONFIG_ETHERNET_SPI_CLOCK_MHZ=20
